{
	"main": [
		{
			"intro": "Hi, I'm",
			"name": "Joao Reis",
			"job": "a software development engineer",
			"presentation": "specialized in JavaScript. I have expertise in designing robust architectures and solving complex problems. Passionate about technology, I enjoy exploring new technologies and sharing my knowledge with the developer community. Open to discussions and exchanges on emerging technologies, I am always enthusiastic about sharing my knowledge and learning from other developers.",
			"button": "Send a message ..."
		}
	],
	"me": [
		{
			"title": "Who am I?",
			"presentation": [
				{
					"id": "1",
					"text": "For several years, my interest in software development has continued to grow. However, it was in 2020 that I felt an irresistible urge to change my professional path to fulfill my ultimate dream, to fully dedicate myself to software development! Before embracing this passion, I worked as a works manager in the construction sector, and then held a position in the back office of a communication company."
				},
				{
					"id": "2",
					"text": "These experiences have provided me with essential skills in client and team management, but my heart was elsewhere, in the world of computer development."
				},
				{
					"id": "3",
					"text": "In 2020, I finally decided to follow my true passion and actively contribute to the advancement of this fascinating field. During my training, I had the opportunity to explore languages ​​such as JavaScript, HTML, CSS, Mongodb, SQL, and Python. Quickly, I found my way by specializing in technologies such as JavaScript and Mongodb."
				},
				{
					"id": "4",
					"text": "Furthermore, I completed my training by taking courses on good development practices (Opquast) and agile methodologies. Every day, I invest with passion and determination in the world of software development, eager to continue learning and contributing to innovative and challenging projects."
				}
			]
		}
	],

	"workplaces": [
		{
			"company": "Lectra",
			"position": "Software Developer in JavaScript",
			"date": "June 2022 to Present",
			"details": {
				"description": "As a Project Owner and developer within an Agile team, I am responsible for the successful implementation and integration of our company's PLM into our's customers ecosystems.",
				"responsibilities": "By overseeing every aspect of the project from requirements analysis to final delivery, I ensure that customized solutions fully meet customer expectations. My role also includes coordinating development efforts and ensuring code and feature quality, while ensuring smooth integration with client's existing systems.",
				"conclusion": "Essentially, as a Project Owner, I am committed to ensuring the overall success of the PLM project, maintaining a clear vision throughout the process, while actively contributing to PLM development."
			},
			"company_url": "https://www.montauban-renovation.com/"
		},
		{
			"company": "Noveoo",
			"position": "Web Developer / Founder",
			"date": "September 2021 to 2022",
			"details": {
				"description": "Our company offered services including creating Showcase, E-commerce, and custom websites, as well as website redesign using technologies such as Svelte, CMS, Django, Tailwind, and Bootstrap. We also ensured technical follow-up and maintenance of websites and web applications according to specific client requirements.",
				"responsibilities": "To ensure effective project management, we adopted an agile approach using the Scrum methodology. This methodology allowed us to work iteratively and collaboratively, promoting transparent communication and continuous adaptation to evolving needs."
			},
			"company_url": "https://www.montauban-renovation.com/"
		},
		{
			"company": "Montauban",
			"position": "Intern",
			"date": "February 2021 to March 2021",
			"details": {
				"description": "The aim of the project was to develop a comprehensive customer lifecycle and customer file management application. The agile Scrum methodology was adopted to achieve this goal. This approach allowed the project to be broken down into iterations called 'sprints', each focused on implementing specific features defined in collaboration with stakeholders.",
				"responsibilities": "The development team worked closely with the product owner to prioritise features based on their business value. Tasks were assigned and tracked using agile project management tools, and retrospective sessions were integrated at the end of each sprint to analyse performance and identify areas for improvement.",
				"conclusion": "This iterative and collaborative approach fostered transparent communication and constant adaptation to changing needs, ensuring a process of continuous improvement throughout the application development."
			},
			"company_url": "https://www.montauban-renovation.com/"
		},
		{
			"company": "Simplon",
			"position": "Learner",
			"date": "October 2020 to July 2021",
			"details": {
				"description": "Learning basic languages like JavaScript, HTML, and CSS.",
				"responsibilities": "Database design. Learning MCD and MLD.",
				"conclusion": "Completion of several projects to improve general knowledge of the developer profession"
			},
			"company_url": "https://simplon.co/"
		},
		{
			"company": "Patriarca",
			"position": "Works Manager",
			"date": "January 2019 to March 2020",
			"details": {
				"description": "Coordination of works carried out in one or more construction sites, ensuring quality, deadlines, and budget adherence.",
				"responsibilities": "Technical, administrative, and financial monitoring of the construction site and subcontracting companies.",
				"conclusion": "Study of the file and contracts, preparation of the operation, definition of needs, methods, human and material resources, planning of the operation"
			},
			"company_url": "http://www.patriarca.fr"
		}
	]
}
